<?php
//基本設定
$html_lang ="zh-Hant";

//語系切換選單
$zh_tw = "中文";
$ja = "日文";
$en = "英文";

//標題
$WebTitle = "二十四節氣";

//返回首頁按鈕
$backhome = "回首頁";

//四季
//二十四節氣
//七十二候
$NameStr =array( 
    "春季"=> array(
        '立春'=> array('東風解凍、蟄蟲始振、魚上氷'),
        '雨水'=> array('獺祭魚、鴻雁來、草木萌動'),
        '驚蟄'=> array('桃始華、倉庚鳴、鷹化為鳩'), 
        '春分'=> array('玄鳥至、雷乃發聲、始雷'), 
        '清明'=> array('桐始華、田鼠化為鴽、虹始見'), 
        '穀雨'=> array('萍始生、鳴鳩拂其羽、戴勝降於桑')
    ),
    "夏季"=> array(
        '立夏'=> array('螻蟈鳴、蚯蚓出、王瓜生'), 
        '小滿'=> array('苦菜秀、靡草死、小暑至'),  
        '芒種'=> array('螳螂生、鵑始鳴、反舌無聲'),  
        '夏至'=> array('鹿角解、蜩始鳴、半夏生'),  
        '小暑'=> array('溫風至、蟋蜂居壁、鷹乃學習'), 
        '大暑'=> array('腐草為螢、土潤溽暑、大雨時行')
    ),
    "秋季"=> array(
        '立秋'=> array('涼風至、白露降、寒蟬鳴'), 
        '處暑'=> array('鷹乃祭鳥、天地始肅、禾乃登'), 
        '白露'=> array('鴻雁來、玄鳥歸、群鳥養羞'), 
        '秋分'=> array('雷始收聲、蟄蟲坯戶、水始涸'), 
        '寒露'=> array('鴻雁來賓、雀入大水為蛤、菊有黃花'), 
        '霜降'=> array('豺乃祭獸、草木黃落、蟄蟲咸俯')
    ),
    "冬季"=> array(
        '立冬'=> array('水始氷、地始凍、雉入大水為蜃'), 
        '小雪'=> array('虹藏不見、天氣上升地氣下降、閉塞而成冬'), 
        '大雪'=> array('鶡鴠不鳴、虎始交、荔挺出'), 
        '冬至'=> array('蚯蚓結、麇角解、水泉動'), 
        '小寒'=> array('雁北鄉、鵲始巢、雉始雊'), 
        '大寒'=> array('雞始乳、鷙鳥厲疾、水澤腹堅')
    )
);
?>