<?php
//基本設定
$html_lang ="ja";

//語系切換選單
$zh_tw = "中国語";
$ja = "日本語";
$en = "英語";

//標題
$WebTitle = "二十四節気（にじゅうしせっき）";

//返回首頁按鈕
$backhome = "トップページ";

//四季
//二十四節氣
//七十二候
$NameStr =array( 
    "春季"=> array(
        '立春'=> array('東風解凍（こちこおりをとく）、黄鶯睍睆（うぐいすなく）、魚上氷（うおこおりをいずる）'),
        '雨水'=> array('土脉潤起（つちのしょううるおいおこる）、霞始靆（かすみはじめてたなびく）、草木萌動（そうもくめばえいずる）'),
        '啓蟄'=> array('蟄虫啓戸（すごもりむしとをひらく）、桃始笑（ももはじめてさく）、菜虫化蝶（なむしちょうとなる）'), 
        '春分'=> array('雀始巣（すずめはじめてすくう）、桜始開（さくらはじめてひらく）、雷乃発声（かみなりすなわちこえをはっす）'), 
        '清明'=> array('玄鳥至（つばめきたる）、鴻雁北（こうがんきたへかえる）、虹始見（にじはじめてあらわる）'), 
        '穀雨'=> array('葭始生（あしはじめてしょうず）、霜止出苗（しもやんでなえいづる）、牡丹華（ぼたんはなさく）')
    ),
    "夏季"=> array(
        '立夏'=> array('螻蟈鳴、蚯蚓出、王瓜生'), 
        '小満'=> array('苦菜秀、靡草死、小暑至'),  
        '芒種'=> array('螳螂生、鵑始鳴、反舌無聲'),  
        '夏至'=> array('鹿角解、蜩始鳴、半夏生'),  
        '小暑'=> array('溫風至、蟋蜂居壁、鷹乃學習'), 
        '大暑'=> array('腐草為螢、土潤溽暑、大雨時行')
    ),
    "秋季"=> array(
        '立秋'=> array('涼風至、白露降、寒蟬鳴'), 
        '処暑'=> array('鷹乃祭鳥、天地始肅、禾乃登'), 
        '白露'=> array('鴻雁來、玄鳥歸、群鳥養羞'), 
        '秋分'=> array('雷始收聲、蟄蟲坯戶、水始涸'), 
        '寒露'=> array('鴻雁來賓、雀入大水為蛤、菊有黃花'), 
        '霜降'=> array('豺乃祭獸、草木黃落、蟄蟲咸俯')
    ),
    "冬季"=> array(
        '立冬'=> array('水始氷、地始凍、雉入大水為蜃'), 
        '小雪'=> array('虹藏不見、天氣上升地氣下降、閉塞而成冬'), 
        '大雪'=> array('鶡鴠不鳴、虎始交、荔挺出'), 
        '冬至'=> array('蚯蚓結、麇角解、水泉動'), 
        '小寒'=> array('雁北鄉、鵲始巢、雉始雊'), 
        '大寒'=> array('雞始乳、鷙鳥厲疾、水澤腹堅')
    )
);
?>